# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'svn' # Needed to install fonts

# Development
brew 'meilisearch'
brew 'mysql'
brew 'node'
brew 'yarn'
brew 'mailpit'
brew 'php-cs-fixer'

# SysOps
brew 'htop'
brew 'nmap'
brew 'awscli'
brew 'wget'
brew 'gnu-sed'

# Apps
cask 'figma'
cask 'herd'
cask 'brave-browser'
cask 'tableplus'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'spotify'
cask 'whatsapp'
cask 'macpass'
cask 'logitech-options'
cask 'iterm2'

# Fonts
cask 'font-lato'
cask 'font-inter'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
